Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: LVGL is capable of loading XML files at runtime without recompiling the application.
it_it: LVGL è in grado di caricare file XML in fase di esecuzione senza ricompilare l'applicazione.

source: LVGL is distributed through `ESP Registry <https://components.espressif.com/>`__, where all LVGL releases are uploaded.
it_it: LVGL è distribuito tramite `ESP Registry <https://components.espressif.com/>`__, dove vengono caricate tutte le release LVGL.

source: LVGL is implemented in C and its APIs are in C.
it_it: LVGL è implementato in C e le sue API sono in C.

source: LVGL is not included in the SDK so you should build whichever version you need.
it_it: LVGL non è incluso nell'SDK, quindi è consigliabile compilare la versione necessaria.

source: LVGL is well-suited to these boards.
it_it: LVGL è particolarmente adatto a queste schede.

source: LVGL maintains a few projects for STM32 boards.
it_it: LVGL gestisce alcuni progetti per schede STM32.

source: LVGL manages many complex data structures, and those structures are "system resources" that must be protected from being "seen" by other threads in an inconsistent state.
it_it: LVGL gestisce molte strutture dati complesse, che sono "risorse di sistema" che devono essere protette dall'essere "viste" da altri thread in uno stato incoerente.

source: LVGL might render the screen in multiple chunks and therefore call your Flush Callback multiple times.
it_it: LVGL potrebbe visualizzare lo schermo in più blocchi e quindi chiamare la funzione di Callback Flush più volte.

source: LVGL needs awareness of what time it is (i.e. elapsed time in milliseconds) for all of its tasks for which time is a factor: refreshing displays, reading user input, firing events, animations, etc.
it_it: LVGL ha bisogno di conoscere l'ora esatta (ovvero il tempo trascorso in millisecondi) per tutte le attività in cui il tempo è un fattore determinante: aggiornamento dei display, lettura dell'input dell'utente, attivazione di eventi, animazioni, ecc.

source: LVGL needs just one simple driver function to copy an array of pixels into a given area of the display.
it_it: LVGL richiede solo una semplice funzione driver per copiare un array di pixel in una determinata area del display.

source: LVGL needs to be supplied with knowledge about each display panel you want it to use.
it_it: LVGL deve essere dotato di informazioni su ciascun pannello di visualizzazione che si desidera utilizzare.

source: LVGL needs to know how to get input from all user-input devices that will be used in your project.
it_it: LVGL deve sapere come ricevere input da tutti i dispositivi di input utente che verranno utilizzati nel progetto.

source: LVGL not only supports RTL text but supports mixed (a.k.a.
it_it: LVGL non supporta solo il testo RTL, ma supporta anche il rendering misto (noto anche come

source: LVGL on Alif Boards
it_it: LVGL su schede Alif

source: LVGL provides a complete glTF demo that showcases the capabilities of the 3D viewer:
it_it: LVGL fornisce una demo glTF completa che mostra le funzionalità del visualizzatore 3D:

source: LVGL provides a custom RLE (Run-Length Encoding) decompression method.
it_it: LVGL fornisce un metodo di decompressione RLE (Run-Length Encoding) personalizzato.

source: LVGL provides a preconfigured Codespace environment, which you can launch with just a few clicks.
it_it: LVGL fornisce un ambiente Codespace preconfigurato, avviabile con pochi clic.

source: LVGL provides an e2 Studio plugin to facilitate working with LVGL projects.
it_it: LVGL fornisce un plugin per e2 Studio per facilitare l'utilizzo dei progetti LVGL.

source: LVGL provides many useful functions to modify the Widget tree and get information about it:
it_it: LVGL fornisce molte funzioni utili per modificare l'albero dei Widget e ottenere informazioni su di esso:

source: LVGL provides the "GUI engine" that handles all end-user interaction with your application, including not only drawing the contents of the display and accepting user input and turning it into events "catchable" by the application, but also providing 30+ built-in widgets, 100+ style properties, scrolling, animations, advanced software rendering, built-in GPU support from MCUs to OpenGL, and much more.
it_it: LVGL fornisce il "motore GUI" che gestisce tutte le interazioni dell'utente finale con l'applicazione, tra cui non solo la visualizzazione del contenuto del display, l'accettazione dell'input dell'utente e la sua conversione in eventi "catturabili" dall'applicazione, ma anche oltre 30 widget integrati, oltre 100 proprietà di stile, scrolling [scorrimento], animazioni, software di rendering avanzato, supporto GPU integrato da MCU a OpenGL e molto altro.

source: LVGL provides the extremely fast LZ4 decompression method found in the `LZ4 repository <https://github.com/lz4/lz4>`__ on GitHub.
it_it: LVGL fornisce il metodo di decompressione LZ4 estremamente veloce disponibile nel `repository di LZ4 <https://github.com/lz4/lz4>`__ su GitHub.

source: LVGL provides three OpenGL drivers to suit different application needs and platforms:
it_it: LVGL fornisce tre driver OpenGL per soddisfare diverse esigenze applicative e piattaforme:

source: LVGL provides two functions to control the animation mode: :cpp:func:`lv_rlottie_set_play_mode` and :cpp:func:`lv_rlottie_set_current_frame`.
it_it: LVGL fornisce due funzioni per controllare la modalità di animazione: :cpp:func:`lv_rlottie_set_play_mode` e :cpp:func:`lv_rlottie_set_current_frame`.

source: LVGL recipe
it_it: Ricetta LVGL

source: LVGL saves ``x = 20`` in the widget’s local style.
it_it: LVGL salva ``x = 20`` nello stile locale del widget.

source: LVGL scrolls to the snap point with an animation.
it_it: LVGL scorre fino al punto di aggancio con un'animazione.

source: LVGL sends events if the gestures are in one of the following states:
it_it: LVGL invia eventi se i gesti si trovano in uno dei seguenti stati:

source: LVGL source files typically use this include pattern:
it_it: I file sorgente LVGL in genere utilizzano questo schema di inclusione:

source: LVGL stores Widgets in a parent-child structure (tree).
it_it: LVGL memorizza i Widget in una struttura padre-figlio (albero).

source: LVGL supports **UTF-8** encoded Unicode characters.
it_it: LVGL supporta i caratteri Unicode codificati **UTF-8**.

source: LVGL supports ``min-width``, ``max-width``, ``min-height``, and ``max-height``.
it_it: LVGL supporta ``min-width``, ``max-width``, ``min-height`` e ``max-height``.

source: LVGL supports a wide variety of user-input devices:
it_it: LVGL supporta un'ampia varietà di dispositivi di input utente:

source: LVGL supports rendering directly in a 1-bit format for monochrome displays.
it_it: LVGL supporta il rendering diretto in un formato a 1 bit per i display monocromatici.

source: LVGL supports rotation of the display in 90 degree increments.
it_it: LVGL supporta la rotazione del display con incrementi di 90 gradi.

source: LVGL supports some predefined "symbols".
it_it: LVGL supporta alcuni "simboli" predefiniti.

source: LVGL supports the :c:macro:`LV_COLOR_FORMAT_RGB565_SWAPPED` color format natively.
it_it: LVGL supporta nativamente il formato colore :c:macro:`LV_COLOR_FORMAT_RGB565_SWAPPED`.

source: LVGL supports these rules if :c:macro:`LV_USE_ARABIC_PERSIAN_CHARS` is enabled in ``lv_conf.h``.
it_it: LVGL supporta queste regole se :c:macro:`LV_USE_ARABIC_PERSIAN_CHARS` è abilitato in ``lv_conf.h``.

source: LVGL supports two ways of handling translations:
it_it: LVGL supporta due metodi per gestire le traduzioni:

source: LVGL supports, in experimental level, the filling and the image blending acceleration through the PPA, the user can enable it in their ``sdkconfig.defaults`` by adding the following option to enable the PPA draw unit in conjunction with the software renderer, also: don't forget to make the draw buffers aligned with the cache line size, typically 64bytes:
it_it: LVGL supporta, a livello sperimentale, l'accelerazione del riempimento e del blending delle immagini tramite PPA. L'utente può abilitarla nel proprio ``sdkconfig.defaults`` aggiungendo la seguente opzione per abilitare l'unità di disegno PPA in combinazione con il renderer software. Inoltre, non dimenticare di allineare i buffer di disegno con la dimensione della linea di cache, in genere 64 byte:

source: LVGL then waits until :cpp:func:`lv_display_flush_ready` is called (that is, the content of the buffer has been sent to the display) before drawing something new into it.
it_it: LVGL attende quindi che venga chiamata :cpp:func:`lv_display_flush_ready` (ovvero che il contenuto del buffer sia stato inviato al display) prima di disegnarvi qualcosa di nuovo.

source: LVGL tries to optimize the process as much as possible (see below), but you will still need to evaluate if this would be beneficial for your platform or not.
it_it: LVGL cerca di ottimizzare il processo il più possibile (vedere di seguito), ma sarà comunque necessario valutare se questo sia vantaggioso per la propria piattaforma o meno.

source: LVGL tries to render as small area of the widget as possible, but due to the nature of transformations no slicing is possible in this case.
it_it: LVGL cerca di renderizzare l'area più piccola possibile del widget, ma a causa della natura delle trasformazioni, in questo caso non è possibile effettuare alcuna suddivisione.

source: LVGL uses direct memory register access to manipulate the DMA2D peripheral.
it_it: LVGL utilizza l'accesso diretto ai registri di memoria per manipolare la periferica DMA2D.

source: LVGL uses the :cpp:enumerator:`LV_EVENT_GET_SELF_SIZE` event to get the self size of a Widget.
it_it: LVGL utilizza l'evento :cpp:enumerator:`LV_EVENT_GET_SELF_SIZE` per ottenere la dimensione automatica di un Widget.

source: LVGL uses the Top Layer and System Layer to empower you to ensure that certain :ref:`widgets` are *always* on top of other layers.
it_it: LVGL utilizza il Layer Superiore e quello di Sistema per garantire che alcuni tra :ref:`widgets` siano *sempre* sopra gli altri layer.

source: LVGL v9.4.0 brings significant performance improvements, expanded GPU support, and new capabilities for modern embedded and MPU platforms.
it_it: LVGL v9.4.0 offre significativi miglioramenti delle prestazioni, supporto GPU ampliato e nuove funzionalità per le moderne piattaforme embedded e MPU.

source: LVGL will always redraw the whole screen even if only 1 pixel has been changed.
it_it: LVGL eseguirà sempre il rendering dell'intero schermo, anche se è stato modificato solo 1 pixel.

source: LVGL will call it to complete the GPU hardware initialization during startup; set :c:macro:`LV_VG_LITE_USE_GPU_INIT` to 1.
it_it: LVGL la richiamerà per completare l'inizializzazione hardware della GPU durante l'avvio; impostare :c:macro:`LV_VG_LITE_USE_GPU_INIT` a 1.

source: LVGL will register a new image decoder automatically so JPEG files can be used directly as image sources.
it_it: LVGL registrerà automaticamente un nuovo decodificatore di immagini in modo che i file JPEG possano essere utilizzati direttamente come sorgenti di immagini.

source: LVGL will render into the correct location of the buffer.
it_it: LVGL eseguirà il rendering nella posizione corretta del buffer.

source: LVGL will search for a property until a style defines it or use a default value if it's not specified by any of the styles.
it_it: LVGL cercherà una proprietà finché non verrà definita da uno stile oppure utilizzerà un valore predefinito se non è specificato da nessuno degli stili.

source: LVGL will try to allocate this size of memory.
it_it: LVGL tenterà di allocare questa dimensione di memoria.

source: LVGL will use registered image decoders automatically if you try and draw a raw image (i.e. using the ``lv_image`` Widget) but you can use them manually as well.
it_it: LVGL utilizzerà automaticamente i decodificatori di immagini registrati se si tenta di disegnare un'immagine raw (ad esempio utilizzando il Widget ``lv_image``), ma è possibile utilizzarli anche manualmente.

source: LVGL works in various vendors' IDEs, including Arm's Keil MDK, IAR, Renesas's e2 studio, NXP's MCUXpresso, ST's CubeIDE, as well as custom make or CMake projects.
it_it: LVGL funziona negli IDE di vari fornitori, tra cui Keil MDK di Arm, IAR, e2 studio di Renesas, MCUXpresso di NXP, CubeIDE di ST, nonché progetti custom make o CMake.

source: LVGL's :ref:`file_system` module provides an abstraction that enables you to attach any type of file system for LVGL's use.
it_it: Il modulo :ref:`file_system` di LVGL fornisce un'astrazione che consente di collegare qualsiasi tipo di file system per l'utilizzo con LVGL.

source: LVGL's GStreamer implementation provides comprehensive media playback capabilities:
it_it: L'implementazione di GStreamer di LVGL offre funzionalità complete di riproduzione multimediale:

source: LVGL's UI Editor always generates a call to :cpp:expr:`lv_xml_register_font` using the set ``name``.
it_it: L'editor dell'interfaccia utente di LVGL genera sempre una chiamata a :cpp:expr:`lv_xml_register_font` utilizzando il set ``name``.

source: LVGL's UI Editor can also generate code from the component's XML.
it_it: L'editor dell'interfaccia utente di LVGL può anche generare codice dall'XML del componente.

source: LVGL's UI Editor can export C code for Screens as well.
it_it: L'UI Editor di LVGL può esportare anche il codice C per gli Screen.

source: LVGL's UI Editor generates a call to :cpp:expr:`lv_xml_register_font` using the set ``name``.
it_it: L'editor dell'interfaccia utente di LVGL genera una chiamata a :cpp:expr:`lv_xml_register_font` utilizzando il set ``name``.

source: LVGL's UI Editor generates this:
it_it: L'UI Editor genera questo:

source: LVGL's XML Module implements LVGL's Declarative UI by making it possible to describe UIs in XML.
it_it: Il modulo XML di LVGL implementa l'interfaccia utente dichiarativa di LVGL consentendo di descrivere le interfacce utente in XML.

source: LVGL's ``LVGLImage.py`` Python tool can be used to convert images to binary pixel map files.
it_it: Il tool Python ``LVGLImage.py`` di LVGL può essere utilizzato per convertire le immagini in file binari di "pixel map".

source: LVGL's built-in font engine is suitable for most typical cases.
it_it: Il "font engine" integrato in LVGL è adatto alla maggior parte dei casi tipici.

source: LVGL's font interface is designed to be very flexible but, even so, you can add your own font engine in place of LVGL's internal one.
it_it: L'interfaccia dei font di LVGL è progettata per essere molto flessibile, ma, nonostante ciò, è possibile aggiungere un proprio motore di font al posto di quello interno di LVGL.

source: LVGL's general API can still be used to modify any widget in the component, but no dedicated API functions are generated.
it_it: L'API generale di LVGL può comunque essere utilizzata per modificare qualsiasi widget nel componente, ma non vengono generate funzioni API dedicate.

source: LVGL's glTF implementation provides comprehensive 3D rendering capabilities:
it_it: L'implementazione glTF di LVGL offre funzionalità complete di rendering 3D:

source: LVGL+NuttX profiler integration
it_it: Integrazione del profiler LVGL+NuttX

source: LVGL/Arduino/ESP-IDF is well-suited to these boards.
it_it: LVGL/Arduino/ESP-IDF sono particolarmente adatti a queste schede.

source: LVGL’s UI Editor Online Share
it_it: Condivisione Online dell'Editor dell'Interfaccia Utente di LVGL

source: LZ4 Decompression
it_it: Decompressione LZ4

source: LZ4 compress statistics from lz4.org
it_it: Statistiche di compressione LZ4 da lz4.org

source: LZ4 images can then be used in the same way as other images.
it_it: Le immagini LZ4 possono quindi essere utilizzate allo stesso modo delle altre immagini.

source: LZ4 is best at compressing data where compression and decompression speed is a priority over compression ratio, making it ideal for applications like real-time data processing.
it_it: LZ4 è ideale per comprimere i dati in situazioni in cui la velocità di compressione e decompressione è prioritaria rispetto al rapporto di compressione, il che lo rende ideale per applicazioni come l'elaborazione dati in tempo reale.

source: Label
it_it: Etichetta

source: Label Draw Descriptor
it_it: Descrittore di Disegno dell'Etichetta

source: Label as an image
it_it: Etichetta come immagine

source: Labels are able to show text from a static character buffer as well.
it_it: Le etichette possono visualizzare anche il testo da un buffer di caratteri statico.

source: Labels can also be moved a fixed distance in X and Y pixels using :cpp:expr:`lv_obj_set_style_translate_x(scale, 10, LV_PART_INDICATOR)`.
it_it: Le etichette possono anche essere spostate di una distanza fissa in pixel X e Y utilizzando :cpp:expr:`lv_obj_set_style_translate_x(scale, 10, LV_PART_INDICATOR)`.

source: Labels that would be upside down are then rotated 180\ |deg| :cpp:expr:`lv_obj_set_style_transform_rotation(scale, LV_SCALE_LABEL_ROTATE_MATCH_TICKS | LV_SCALE_LABEL_ROTATE_KEEP_UPRIGHT, LV_PART_INDICATOR)`.
it_it: Le etichette che sarebbero capovolte vengono quindi ruotate di 180\ |deg| :cpp:expr:`lv_obj_set_style_transform_rotation(scale, LV_SCALE_LABEL_ROTATE_MATCH_TICKS | LV_SCALE_LABEL_ROTATE_KEEP_UPRIGHT, LV_PART_INDICATOR)`.

source: Language Translations
it_it: Traduzioni

source: Language codes are free-form, but ISO-style codes are recommended.
it_it: I codici delle lingue sono in formato libero, ma si consigliano codici in stile ISO.

source: Languages like Arabic, Persian, and Hebrew, which use Right-to-Left (RTL) or mixed writing directions, are also supported in LVGL.
it_it: Anche lingue come l'arabo, il persiano e l'ebraico, che utilizzano direzioni di scrittura da destra a sinistra (RTL) o miste, sono supportate in LVGL.

source: Larger buffers can enhance performance, especially when used with **CONFIG_LV_Z_FULL_REFRESH**.
it_it: Buffer più grandi possono migliorare le prestazioni, soprattutto se utilizzati con **CONFIG_LV_Z_FULL_REFRESH**.

source: Larger padding makes it larger, smaller padding makes it smaller.
it_it: Un padding maggiore lo rende più grande, un padding minore lo rende più piccolo.

source: Larger values means larger space.
it_it: Valori più grandi indicano spazio maggiore.

source: Lastly, use the LVGL Editor's export code functionality to generate C code, which the Renesas extension will automatically detect and include in its build.
it_it: Infine, si utilizza la funzionalità di esportazione del codice di LVGL Editor per generare codice C, che l'estensione Renesas rileverà e includerà automaticamente nella sua build.

source: Later ``const`` style can be used like any other style but (obviously) new properties cannot be added.
it_it: In seguito, lo stile ``const`` potrà essere utilizzato come qualsiasi altro stile, ma (ovviamente) non sarà possibile aggiungere nuove proprietà.

source: Later that layer will be merged to the screen or its parent layer at the correct point in the rendering sequence.
it_it: Successivamente, quel layer verrà unito allo schermo o al suo layer padre nel punto corretto della sequenza di rendering.

source: Later versions of LVGL include the optimal OpenGL driver.
it_it: Le versioni successive di LVGL includono il driver OpenGL ottimale.

source: Later, they can be referenced by their names.
it_it: In seguito, è possibile fare riferimento a essi tramite i loro nomi.

source: Later, when using paths to files on your file system, you prefix the path with that identifier character plus a colon (':').
it_it: In seguito, quando si utilizzano path per i file sul file system, si antepone al percorso quel carattere identificativo più due punti (':').

source: Launch Screen
it_it: Screen di Avvio

source: Layer Buffers
it_it: Buffer dei Layer

source: Layer Type Memory Requirements
it_it: Requisiti di Memoria per i Tipi di Layer

source: Layer Types
it_it: Tipi di Layer

source: Layer buffers can be large, so ensure there is sufficient heap memory or increase :c:macro:`LV_MEM_SIZE` in ``lv_conf.h``.
it_it: I buffer dei layer possono essere di grandi dimensioni, quindi assicurarsi che ci sia sufficiente memoria heap o aumentare :c:macro:`LV_MEM_SIZE` in ``lv_conf.h``.

source: Layer rendering, where only part of a layer may be rendered and ``clip_radius`` needs the original image dimensions.
it_it: Rendering dei layer, in cui è possibile renderizzare solo una parte di un layer e ``clip_radius`` necessita delle dimensioni dell'immagine originale.

source: Layer(s): Each :ref:`Display object <display_overview>` has its own list of :ref:`draw_layers`
it_it: Layer: Ogni :ref:`oggetto Display <display_overview>` ha il proprio elenco di :ref:`draw_layers`

source: Layers
it_it: I Layer

source: Layers - Special Images
it_it: Layer - Immagini Speciali

source: Layers Created to Implement Clip Corner Style While Rendering
it_it: Layer Creati per Implementare lo Stile "Clip Corner" Durante il Rendering

source: Layers are not supported.
it_it: I layer non sono supportati.

source: Layers are repositories that contain related metadata (i.e. sets of instructions) that tell the OpenEmbedded build system how to build a target.
it_it: I layer sono repository che contengono metadati correlati (ovvero set di istruzioni) che indicano al sistema di build di OpenEmbedded come compilare un target.

source: Layers are treated as images, so an :cpp:type:`lv_draw_image_dsc_t` can describe how layers are blended into their parent layers.
it_it: I layer sono trattati come immagini, quindi un :cpp:type:`lv_draw_image_dsc_t` può descrivere come i layer vengono fusi con i layer genitori.

source: Layers logically separate information for your project.
it_it: I layer separano logicamente le informazioni per il progetto.

source: Layers with rotation are not currently supported.
it_it: I layer con rotazione non sono attualmente supportati.

source: Layers with transparent pixels and an overall layer transparency will not blend correctly.
it_it: I layer con pixel trasparenti e una trasparenza complessiva del layer non si fonderanno correttamente.

source: Layouts
it_it: Layout

source: Layouts are described in detail in their own section of documentation.
it_it: I layout sono descritti in dettaglio nella relativa sezione della documentazione.

source: Layouts assigned to a Widget manage the positions and in some cases the sizes of that Widget's children.
it_it: I layout assegnati a un Widget gestiscono le posizioni e, in alcuni casi, le dimensioni degli elementi figlio di quel Widget.

source: Learn all about Events in the :ref:`events` section.
it_it: Si può scoprire tutto sugli eventi nella sezione :ref:`events`.

source: Learn by Examples
it_it: Imparare dagli Esempi

source: Learn more :ref:`here <bidi>`.
it_it: Per saperne di più :ref:`qui <bidi>`.

source: Learn more :ref:`here <editor_cli>`.
it_it: Scoprirne di più :ref:`qui <editor_cli>`.

source: Learn more :ref:`here <editor_figma>`.
it_it: Scoprirne di più :ref:`qui <editor_figma>`.

source: Learn more :ref:`here <editor_online_share>`.
it_it: Se ne parla estesamente :ref:`qui <editor_online_share>`.

source: Learn more :ref:`here <libs_filesystem>`.
it_it: Per saperne di più :ref:`qui <libs_filesystem>`.

source: Learn more about :ref:`events`.
it_it: Scoprire di più sugli :ref:`events`.

source: Learn more about :ref:`indev_keys`.
it_it: Scoprire di più sui :ref:`indev_keys`.

source: Learn more about :ref:`lv_obj_events` emitted by all Widgets.
it_it: Scoprire di più sugli :ref:`lv_obj_events` emessi da tutti i Widget.
